#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_project_service.cloudresourcemanager: Refreshing state... [id=de-challenge-336404/cloudresourcemanager.googleapis.com]
module.raw-bucket-metascore.google_storage_bucket.bucket: Refreshing state... [id=de-challenge-336404-metascore-raw]
module.landing-bucket-metascore.google_storage_bucket.bucket: Refreshing state... [id=de-challenge-336404-metascore-lnd]
google_pubsub_topic.ldn_arrive_topic: Refreshing state... [id=projects/de-challenge-336404/topics/metascore-lnd-notification]
module.analytics_dataset["consumption"].google_bigquery_dataset.main: Refreshing state... [id=projects/de-challenge-336404/datasets/consumption]
module.analytics_dataset["staging"].google_bigquery_dataset.main: Refreshing state... [id=projects/de-challenge-336404/datasets/staging]
module.analytics-bucket-metascore.google_storage_bucket.bucket: Refreshing state... [id=de-challenge-336404-metascore-analytics]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-lnd/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:zahid.galea@wom.cl]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-analytics/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-analytics/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-analytics/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challenge-336404-metascore-analytics/roles/storage.objectViewer/user:zahid.galea@wom.cl]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-raw/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:zahid.galea@wom.cl]
google_pubsub_topic_iam_binding.ldn_arrive_binding: Refreshing state... [id=projects/de-challenge-336404/topics/metascore-lnd-notification/roles/pubsub.publisher]
module.analytics_dataset_data_viewer["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=projects/de-challenge-336404/datasets/staging/roles/bigquery.dataViewer/user:gustavo.aguilar0@walmart.com]
module.analytics_dataset_data_viewer["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=projects/de-challenge-336404/datasets/staging/roles/bigquery.dataViewer/user:mariano.gonzalez0@walmart.com]
module.analytics_dataset_data_viewer["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:zahid.galea@wom.cl"]: Refreshing state... [id=projects/de-challenge-336404/datasets/staging/roles/bigquery.dataViewer/user:zahid.galea@wom.cl]
module.analytics_dataset_data_viewer["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=projects/de-challenge-336404/datasets/consumption/roles/bigquery.dataViewer/user:gustavo.aguilar0@walmart.com]
module.analytics_dataset_data_viewer["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=projects/de-challenge-336404/datasets/consumption/roles/bigquery.dataViewer/user:mariano.gonzalez0@walmart.com]
module.analytics_dataset_data_viewer["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:zahid.galea@wom.cl"]: Refreshing state... [id=projects/de-challenge-336404/datasets/consumption/roles/bigquery.dataViewer/user:zahid.galea@wom.cl]
module.analytics_dataset_data_owner["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:zahidale.zg@gmail.com"]: Refreshing state... [id=projects/de-challenge-336404/datasets/staging/roles/bigquery.dataOwner/user:zahidale.zg@gmail.com]
module.analytics_dataset_data_owner["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:zahidale.zg@gmail.com"]: Refreshing state... [id=projects/de-challenge-336404/datasets/consumption/roles/bigquery.dataOwner/user:zahidale.zg@gmail.com]
google_storage_notification.object_landing_notification: Refreshing state... [id=de-challenge-336404-metascore-lnd/notificationConfigs/5]
google_project_service.project["datastudio.googleapis.com"]: Refreshing state... [id=de-challenge-336404/datastudio.googleapis.com]
google_project_service.project["container.googleapis.com"]: Refreshing state... [id=de-challenge-336404/container.googleapis.com]
google_project_service.project["cloudbuild.googleapis.com"]: Refreshing state... [id=de-challenge-336404/cloudbuild.googleapis.com]
google_project_service.project["cloudfunctions.googleapis.com"]: Refreshing state... [id=de-challenge-336404/cloudfunctions.googleapis.com]
google_project_service.project["compute.googleapis.com"]: Refreshing state... [id=de-challenge-336404/compute.googleapis.com]
google_project_service.project["dataflow.googleapis.com"]: Refreshing state... [id=de-challenge-336404/dataflow.googleapis.com]
google_project_service.project["storage-component.googleapis.com"]: Refreshing state... [id=de-challenge-336404/storage-component.googleapis.com]
google_project_service.project["bigquery.googleapis.com"]: Refreshing state... [id=de-challenge-336404/bigquery.googleapis.com]
google_project_service.project["iam.googleapis.com"]: Refreshing state... [id=de-challenge-336404/iam.googleapis.com]
google_project_service.project["iamcredentials.googleapis.com"]: Refreshing state... [id=de-challenge-336404/iamcredentials.googleapis.com]
google_project_service.project["appengine.googleapis.com"]: Refreshing state... [id=de-challenge-336404/appengine.googleapis.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.analytics_dataset["consumption"].google_bigquery_dataset.main has changed
  ~ resource "google_bigquery_dataset" "main" {
      ~ etag                            = "ZtexQ6XuX+q2MZ4svKEfeA==" -> "HLikofDJKrP2so03r5ZhMw=="
        id                              = "projects/de-challenge-336404/datasets/consumption"
      + labels                          = {}
      ~ last_modified_time              = 1640717228846 -> 1640717242813
        # (8 unchanged attributes hidden)

      + access {
          + role          = "OWNER"
          + user_by_email = "zahidale.ZG@gmail.com"
        }
      + access {
          + role          = "READER"
          + user_by_email = "gustavo.aguilar0@walmart.com"
        }
      + access {
          + role          = "READER"
          + user_by_email = "mariano.gonzalez0@walmart.com"
        }
      + access {
          + role          = "READER"
          + user_by_email = "zahid.galea@wom.cl"
        }
        # (4 unchanged blocks hidden)
    }

  # module.analytics_dataset["staging"].google_bigquery_dataset.main has changed
  ~ resource "google_bigquery_dataset" "main" {
      ~ etag                            = "k8JQG+BeJA1I5sMq2eMD2Q==" -> "wfBdmuuZn3iTbZQX8XMFlw=="
        id                              = "projects/de-challenge-336404/datasets/staging"
      + labels                          = {}
      ~ last_modified_time              = 1640717228841 -> 1640717242813
        # (8 unchanged attributes hidden)

      + access {
          + role          = "OWNER"
          + user_by_email = "zahidale.ZG@gmail.com"
        }
      + access {
          + role          = "READER"
          + user_by_email = "gustavo.aguilar0@walmart.com"
        }
      + access {
          + role          = "READER"
          + user_by_email = "mariano.gonzalez0@walmart.com"
        }
      + access {
          + role          = "READER"
          + user_by_email = "zahid.galea@wom.cl"
        }
        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_project_service.project["workflows.googleapis.com"] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "de-challenge-336404"
      + service                    = "workflows.googleapis.com"

      + timeouts {
          + create = "30m"
          + update = "40m"
        }
    }

  # google_pubsub_topic.ldn_arrive_topic must be replaced
-/+ resource "google_pubsub_topic" "ldn_arrive_topic" {
      ~ id      = "projects/de-challenge-336404/topics/metascore-lnd-notification" -> (known after apply)
      - labels  = {} -> null
      ~ name    = "metascore-lnd-notification" -> "lnd-notification" # forces replacement
        # (1 unchanged attribute hidden)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_pubsub_topic_iam_binding.ldn_arrive_binding must be replaced
-/+ resource "google_pubsub_topic_iam_binding" "ldn_arrive_binding" {
      ~ etag    = "BwXUOSSNl4o=" -> (known after apply)
      ~ id      = "projects/de-challenge-336404/topics/metascore-lnd-notification/roles/pubsub.publisher" -> (known after apply)
      ~ project = "de-challenge-336404" -> (known after apply)
      ~ topic   = "projects/de-challenge-336404/topics/metascore-lnd-notification" -> "lnd-notification" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_storage_notification.object_landing_notification must be replaced
-/+ resource "google_storage_notification" "object_landing_notification" {
      - custom_attributes = {} -> null
      ~ id                = "de-challenge-336404-metascore-lnd/notificationConfigs/5" -> (known after apply)
      ~ notification_id   = "5" -> (known after apply)
      ~ self_link         = "https://www.googleapis.com/storage/v1/b/de-challenge-336404-metascore-lnd/notificationConfigs/5" -> (known after apply)
      ~ topic             = "//pubsub.googleapis.com/projects/de-challenge-336404/topics/metascore-lnd-notification" -> "lnd-notification" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.artifacts-bucket.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "de-challenge-336404-artifacts"
      + project                     = "de-challenge-336404"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-artifacts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahidale.zg@gmail.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-artifacts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Gustavo.Aguilar0@walmart.com"
      + role   = "roles/storage.objectViewer"
    }

  # module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-artifacts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Mariano.Gonzalez0@walmart.com"
      + role   = "roles/storage.objectViewer"
    }

  # module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-artifacts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahid.galea@wom.cl"
      + role   = "roles/storage.objectViewer"
    }

Plan: 9 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ZahidGalea, Action: `pull_request`, Working Directory: `infraestructure/terraform/de-challenge`, Workflow: `Terraform Planning`*